---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.UpperLimit
source: html/0ade95ab-f644-7255-0d11-6a28ad7c7cab.htm
---
# Autodesk.Revit.DB.Mechanical.Space.UpperLimit Property

Get or set the Upper Limit of the Space.

## Syntax (C#)
```csharp
public Level UpperLimit { get; set; }
```

## Remarks
This property is used to get or set the Upper Limit of the Space.